src/big_dog_rise_of_the_pack_rails/app/controllers/sessions_controller.rb

  def create
    puts "Attempting to log in with email: #{session_params[:email]}"
    user = User.find_by(email: session_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'admin@gmail.com' LIMIT 1