src/big_dog_rise_of_the_pack_rails/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ('krixzy', 'admin@gmail.com', '$2a$12$qI/ZxBjFIDVvBG7KGzwiB.Tbq6VQZBsWaXQhwPCRJkfxReL/yd9yi', '2026-04-23 11:05:09.240835', '2026-04-23 11:05:09.240835') RETURNING "id"
---
  def create
    @user = User.new(user_params)
    User.transaction do
      @user.save!